# Это пример скрипта Python.

# Нажмите Shift+F10, чтобы выполнить его, или замените его своим кодом.
# Нажмите Double Shift для поиска повсюду классов, файлов, окон инструментов, действий и настроек.


def print_hi(name):
    # Используйте точку останова в строке кода ниже для отладки вашего скрипта...
    print(f'Hi, {name}')  # Нажмите Ctrl+F8, чтобы переключить точку останова.


# Нажмите зеленую кнопку в желобе, чтобы запустить скрипт.
if __name__ == '__main__':
    print_hi('PyCharm')

# См. справку PyCharm по адресу https://www.jetbrains.com/help/pycharm/